Revit 2027 API
ArgumentNullException.GetObjectData Method
Retrieves data needed to serialize the target object.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
Public Overrides Sub GetObjectData (
	info As SerializationInfo,
	context As StreamingContext
)
public:
virtual void GetObjectData(
	SerializationInfo^ info,
	StreamingContext context
) override
abstract GetObjectData :
        info : SerializationInfo *
        context : StreamingContext -> unit
override GetObjectData :
        info : SerializationInfo *
        context : StreamingContext -> unit
Parameters
info SerializationInfo
 Data needed to serialize or deserialize the object.
context StreamingContext
 The destination of the serialized stream.
Implements
ISerializable.GetObjectData(SerializationInfo, StreamingContext)
See Also
Reference
ArgumentNullException Class
Autodesk.Revit.Exceptions Namespace